{
    "компонент": "Независимый модуль ПО, который можно использовать повторно.",
    "компонентный_подход": "Разделение программного кода приложения на независимые, слабосвязанные, переиспользуемые компоненты.",
	"фреймворк": "Программная платформа, определяющая структуру программной системы; программное обеспечение, облегчающее разработку и объединение разных компонентов большого программного проекта.",
	"web-components": "Это совокупность стандартов, которые позволяют делать декларативно описываемые, реиспользуемые «виджеты» с изолированными стилями и скриптами в виде собственных тегов.",
	"customelements": "Зарегистрированные пользователем HTML-теги, описанные собственным классом, со своими методами, свойствами, событиями.",
	"автономные_пользовательские_элементы": "Это «полностью новые» элементы, расширяющие абстрактный класс HTMLElement.",
	"пользовательские_встроенные_элементы": "Элементы, расширяющие встроенные, например кнопку HTMLButtonElement и т.п.",
	"теневой DOM": "Cпособ инкапсуляции внутреннего содержания тега, который позволяет изменять внутреннее представление HTML элементов, оставляя внешнее представление неизменным.",
	"html-шаблоны": "Cпециальный тег <template>, предназначенный для хранения шаблонов.",
	"библиотека": "Это набор готовых функций, классов и объектов для решения поставленных задач.",
	"es (ecmascript) modules": "Cтандарт для работы с модульным кодом JavaScript в браузере.",
	"микро-фронтенд": "Подход при котором приложение состояит из компонентов функционирующих как автоновные приложения.",
	"polymer elements": "Библиотека от Google, содержащая более 100 повторно используемых веб-компонентов Polymer в качестве отдельных репозиториев, доступных для просмотра и готовых к использованию.",
	"polymer": "Бесплатная JavaScript  библиотека с открытым исходным кодом для создания веб-приложений с использованием технологии Web-components. Данная библиотека разрабатывается командой Google и добровольцами GitHub.",
	"open sourse": "Программное обеспечение с открытым исходным кодом. Код open sourse программ доступен для просмотра, изучения и последующего изменения. Открытый исходный код позволяет любому пользователю доработать программу или, использовать код для написания новых программ и исправления  в них ошибок, если это допускает лицензия.",
	"elix": "Управляемый сообществом набор повторно используемых и настраиваемых веб-компонентов для распространенных шаблонов пользовательского интерфейса. Для обеспечения высоких стандартов качества компоненты оцениваются по списку Gold Standard для веб-компонентов, в котором встроенные HTML-элементы используются в качестве стандарта качества.",
	"patternfly": "Коллекция, состоящая из 20 гибких и легких веб-компонентов, а так же инструментов для их создания. Элементы PatternFly обладают легким весом и ограничением boilerplating.",
	"boilerplte code": "Секция кода, которая должна быть написана во многих местах с минимальными изменениями.",
	"lit-element": "Простой шаблон для создания быстрых, легких веб-компонентов, которые работают на любой веб-странице  с использованием какого-либо фреймворка.",
	"stencil": "Компилятор генерирующий веб-компоненты, который был разработан Ionic  командой. Для создания стандартизированных Веб-компонентов  используюся возможности vitual DOM, Typescript  и JSX."

}
